---
kind: other
id: Methods.T:Autodesk.Revit.DB.Lighting.SpotLightDistribution
source: html/486675f0-c2e3-a7bc-f3eb-6a8bfb8a4c20.htm
---
# SpotLightDistribution Methods

Creates a copy of the LightDistribution derived object.